[
    {
        "title": "Hero Hub",
        "description": "An intranet website and mobile app developed for Hero Motors Company, designed to streamline internal communication, news updates, employee engagement, and document sharing across departments. Includes role-based access, notifications, and multi-platform support.",
        "image": "assets/images/hero_hub.png",
        "framework": "Flutter(Web + Mobile)"
    },
    {
        "title": "Digital Twin",
        "description": "A web-based automotive diagnostics and visualization tool developed for Tata Motors. It contains detailed vehicle data and real-time diagnostics The platform is designed for both internal use and customer engagement, providing insights into vehicle performance and maintenance.",
        "image": "assets/images/digital_twin.png",
        "framework": "Flutter Web"
    },
    {
        "title": "Adva by Olam",
        "description": "A cross-platform lifestyle and sustainability app that allows users to track their carbon footprint, participate in eco-friendly activities, and earn green points. Offers detailed analytics, personalized suggestions, and gamification features for environmental impact.",
        "image": "assets/images/adva.jpg",
        "framework": "Flutter"
    },
    {
        "title": "Adva Missions",
        "description": "A mission-driven sustainability platform where users complete eco-friendly tasks and redeem points for sustainable products. Features a content-rich dashboard, interactive mission tracking, and a fully functional e-commerce module for ethical shopping.",
        "image": "assets/images/adva_missions_collage.jpg",
        "framework": "React JS"
    },
    {
        "title": "Finacle: ALM",
        "description": "An enterprise-grade application built for Infosys Finacle to help banks manage Asset Liability Management (ALM), including liquidity gaps, interest rate risk, and stress testing. Integrates dynamic dashboards, chart visualizations, and complex financial logic.",
        "image": "assets/images/infosys.webp",
        "framework": "Angular, Charts JS"
    },
    {
        "title": "SBG.ai",
        "description": "A knowledge hub developed for Standard Bank Group featuring internal news, expert articles, training resources, and project updates. Built with React and Gatsby, deployed via Azure, and optimized for performance, scalability, and secure internal access.",
        "image": "assets/images/standard_bank.jpg",
        "framework": "React JS, Gatsby, Azure"
    }
]